#Использовать asserts
#Использовать Collections

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_КонструкторБезПараметров");
	СписокТестов.Добавить("Тест_Должен_КонструкторПараметрМассив");
	СписокТестов.Добавить("Тест_Должен_КонструкторПараметрЧисло");
	
	СписокТестов.Добавить("Тест_Должен_ВернутьКоличество0");
	СписокТестов.Добавить("Тест_Должен_ВернутьКоличество1");
	СписокТестов.Добавить("Тест_Должен_Добавить");
	
	СписокТестов.Добавить("Тест_Должен_Очистить");
	СписокТестов.Добавить("Тест_Должен_ВзятьИзОчереди");
	СписокТестов.Добавить("Тест_Должен_ВернутьСодержит");
	СписокТестов.Добавить("Тест_Должен_ВернутьНеСодержит");
	
	СписокТестов.Добавить("Тест_Должен_ПолучитьХешКод");
	
	СписокТестов.Добавить("Тест_Должен_ВернутьПик");
	СписокТестов.Добавить("Тест_Должен_ВернутьПикПроверкаОшибки");
	
	СписокТестов.Добавить("Тест_Должен_ВМассив");
	СписокТестов.Добавить("Тест_Должен_Обрезать");

	СписокТестов.Добавить("Тест_Должен_Перебрать");
	
	Возврат СписокТестов;
	
КонецФункции


Процедура Тест_Должен_КонструкторБезПараметров() Экспорт
	Стек = Новый Стек();
	Ожидаем.Что(Строка(Стек)).Равно("Стек");
КонецПроцедуры

Процедура Тест_Должен_КонструкторПараметрМассив() Экспорт
	
	Данные = Новый Массив;
	Данные.Добавить(1);
	
	Стек = Новый Стек(Данные);
	Ожидаем.Что(Строка(Стек)).Равно("Стек");
КонецПроцедуры

Процедура Тест_Должен_КонструкторПараметрЧисло() Экспорт
	Стек = Новый Стек(3);
	Ожидаем.Что(Строка(Стек)).Равно("Стек");
КонецПроцедуры


Процедура Тест_Должен_ВернутьКоличество0() Экспорт
	Стек = Новый Стек();
	Ожидаем.Что(Стек.Количество()).Равно(0);
КонецПроцедуры

Процедура Тест_Должен_ВернутьКоличество1() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("данные");
	Ожидаем.Что(Стек.Количество()).Равно(1);
КонецПроцедуры


Процедура Тест_Должен_Добавить() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("данные");
	Ожидаем.Что(Стек.Количество()).Равно(1);
КонецПроцедуры

Процедура Тест_Должен_Очистить() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("данные");
	Стек.Очистить();
	Ожидаем.Что(Стек.Количество()).Равно(0);
КонецПроцедуры


Процедура Тест_Должен_ВзятьИзОчереди() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");

	ПолученноеЗначение = Стек.ВзятьИзОчереди();
	Ожидаем.Что(ПолученноеЗначение).Равно("3");
	
	ПолученноеЗначение = Стек.ВзятьИзОчереди();
	Ожидаем.Что(ПолученноеЗначение).Равно("2");

	Ожидаем.Что(Стек.Количество()).Равно(1);
КонецПроцедуры


Процедура Тест_Должен_ВернутьСодержит() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	Ожидаем.Что(Стек.Содержит("1")).Равно(Истина);
КонецПроцедуры


Процедура Тест_Должен_ВернутьНеСодержит() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	Ожидаем.Что(Стек.Содержит("4")).Равно(Ложь);
КонецПроцедуры

Процедура Тест_Должен_Скопировать() Экспорт
	Приемник = Новый Массив;
	
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	
	Стек.Скопировать(Приемник,1);
	
	Ожидаем.Что(Приемник.Количество()).Равно(2);
КонецПроцедуры


Процедура Тест_Должен_ПолучитьХешКод() Экспорт
	
	// Некоторое непонимание по методу
	
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	
	ХешКод = Стек.ПолучитьХешКод();
	Ожидаем.Что(ХешКод).Больше(0);
КонецПроцедуры


Процедура Тест_Должен_ВернутьПик() Экспорт
	
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	
	Пик = Стек.Пик();
	Ожидаем.Что(Пик).Равно("3");
	Ожидаем.Что(Стек.Количество()).Равно(3);
КонецПроцедуры


Процедура Тест_Должен_ВернутьПикПроверкаОшибки() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	
	Пик = Стек.Пик();
	Ожидаем.Что(Пик).ЭтоНе().Равно("2");
	Ожидаем.Что(Стек.Количество()).Равно(3);
КонецПроцедуры

Процедура Тест_Должен_ВМассив() Экспорт
	Стек = Новый Стек();
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	
	Результат = Стек.ВМассив();
	
	Ожидаем.Что(Результат.Количество()).Равно(3);
КонецПроцедуры


Процедура Тест_Должен_Обрезать() Экспорт
	
	// не понял как тестировать, просто проверяю падает или нет
	
	Стек = Новый Стек(20);
	Стек.Добавить("1");
	Стек.Добавить("2");
	Стек.Добавить("3");
	
	Стек.Обрезать();
	
КонецПроцедуры

Процедура Тест_Должен_Перебрать() Экспорт
	
	Стек = Новый Стек(20);
	Стек.Добавить("Элемент1");
	Стек.Добавить("Элемент2");
	Стек.Добавить("Элемент3");
	
	СтрИтог = "";
	Для каждого Стр Из Стек Цикл
		СтрИтог  = СтрИтог  + Стр;
	КонецЦикла;

	Ожидаем.Что(СтрИтог).Равно("Элемент3Элемент2Элемент1");
	
КонецПроцедуры

